## Plan Result (sbox_shutter_webapp - TerraformPlanApply)




<pre><code>Plan: 15 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_dns_cname_record.cname_record[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_static_site.swebapp[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.azurerm_static_site_custom_domain.custom_domain[&#34;labs-lukaszk-hmcts-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-ashleigh31-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-jamiemcconnell-nodejs&#34;]
  * module.static_webapp.github_actions_secret.secret[&#34;labs-lukaszk-hmcts-nodejs&#34;]
* Update
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-dawidstrozak-nodejs&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-ashleigh&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-dawid&#34;]
  * module.static_webapp.azurerm_dns_txt_record.zone_validate[&#34;labs-goldenpath-jamie&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-ashleigh31-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-jamiemcconnell-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_cname_record.cname_record["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_dns_cname_record" "cname_record" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "labs-lukaszk-hmcts-nodejs-shutter"
      + record              = (known after apply)
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 300
      + zone_name           = "sandbox.platform.hmcts.net"
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-ashleigh31-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-dawidstrozak-nodejs"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-dawidstrozak-nodejs"
        name                = "_dnsauth.labs-dawidstrozak-nodejs"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-ashleigh"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-ashleigh"
        name                = "_dnsauth.labs-goldenpath-ashleigh"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-dawid"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-dawid"
        name                = "_dnsauth.labs-goldenpath-dawid"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-goldenpath-jamie"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "zone_validate" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtRG/providers/Microsoft.Network/dnsZones/sandbox.platform.hmcts.net/TXT/_dnsauth.labs-goldenpath-jamie"
        name                = "_dnsauth.labs-goldenpath-jamie"
        tags                = {}
        # (4 unchanged attributes hidden)

      - record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-jamiemcconnell-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_dns_txt_record.zone_validate["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_dns_txt_record" "zone_validate" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dnsauth.labs-lukaszk-hmcts-nodejs"
      + resource_group_name = "reformMgmtRG"
      + ttl                 = 3600
      + zone_name           = "sandbox.platform.hmcts.net"

      + record {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-ashleigh31-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-jamiemcconnell-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site.swebapp["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_static_site" "swebapp" {
      + api_key             = (sensitive value)
      + default_host_name   = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "labs-lukaszk-hmcts-nodejs"
      + resource_group_name = "cft-platform-shutter-webapp-sbox-rg"
      + sku_size            = "Free"
      + sku_tier            = "Free"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
          + "startupMode"  = "always"
        }
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-ashleigh31-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-ashleigh31-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-jamiemcconnell-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-jamiemcconnell-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.azurerm_static_site_custom_domain.custom_domain["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "azurerm_static_site_custom_domain" "custom_domain" {
      + domain_name      = "labs-lukaszk-hmcts-nodejs.sandbox.platform.hmcts.net"
      + id               = (known after apply)
      + static_site_id   = (known after apply)
      + validation_token = (sensitive value)
      + validation_type  = "dns-txt-token"
    }

  # module.static_webapp.github_actions_secret.secret["labs-ashleigh31-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_ashleigh31_nodejs_sbox"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["labs-jamiemcconnell-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_jamiemcconnell_nodejs_sbox"
      + updated_at      = (known after apply)
    }

  # module.static_webapp.github_actions_secret.secret["labs-lukaszk-hmcts-nodejs"] will be created
  + resource "github_actions_secret" "secret" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "azure-shutter-pages"
      + secret_name     = "labs_lukaszk_hmcts_nodejs_sbox"
      + updated_at      = (known after apply)
    }

Plan: 15 to add, 4 to change, 0 to destroy.
```

</details>





## :warning: Errors

* add a label sbox_shutter_webapp - TerraformPlanApply/add-or-update: POST https://api.github.com/repos/hmcts/azure-platform-terraform/issues/2355/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","PRNumber":2355,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp - TerraformPlanApply","Vars":{}} -->